{{#if:{{{form|}}}|<!--  только формы
-->{{#switch:{{{case|}}}
    |nom-sg={{{nom-sg}}}  |nom-pl={{{nom-pl}}} |nom-sg2={{{nom-sg2|}}} |nom-pl2={{{nom-pl2|}}}
    |gen-sg={{{gen-sg}}}  |gen-pl={{{gen-pl}}} |gen-sg2={{{gen-sg2|}}} |gen-pl2={{{gen-pl2|}}}
    |dat-sg={{{dat-sg}}}  |dat-pl={{{dat-pl}}} |dat-sg2={{{gen-sg2|}}} |dat-pl2={{{dat-pl2|}}}
    |acc-sg={{{acc-sg}}}  |acc-pl={{{acc-pl}}} |acc-sg2={{{acc-sg2|}}} |acc-pl2={{{acc-pl2|}}}
    |ins-sg={{{ins-sg}}}  |ins-pl={{{ins-pl}}} |ins-sg2={{{ins-sg2|}}} |ins-pl2={{{ins-pl2|}}}
    |prp-sg={{{prp-sg}}}  |prp-pl={{{prp-pl}}} |prp-sg2={{{prp-sg2|}}} |prp-pl2={{{prp-pl2|}}}
    |loc-sg={{{loc-sg|}}} 
    |voc-sg={{{voc-sg|}}} 
    |prt-sg={{{prt-sg|}}}
    |pos-sg={{{П|}}}
    |acc2-sg={{{Пр|}}}
    |adnum={{{Сч|}}}
   }}<!--
-->|<!--  полный вывод
-->{{#if:{{{шаблон-кат|}}}|<!--
  -->{{#ifeq:{{NAMESPACE}}|{{ns:Template}}|<!-- только для пространства шаблонов

    Формируем сообщение

    -->{{message box<!--
      -->|backgroundcolor=#f0fff0<!--
      -->|bordercolor=#66cc66<!--
      -->|message=Используется [[:Шаблон:inflection сущ ru]]<!--
      -->|image=Symbol_kept_vote.svg<!--
      -->|heading=Шаблон переведён в современный формат.<!--
    -->}}<!--

    Формируем название категории шаблона

    -->[[Категория:Шаблоны словоизменений/Существительные{{#if:{{{кат|}}}|/<!--
      -->{{#switch:{{{кат|}}}<!--
        -->|одуш=Одушевлённые<!--
        -->|неодуш=Неодушевлённые<!--
      -->}}}}{{#if:{{{род|}}}|/<!--
      -->{{#switch:{{{род|}}}<!--
        -->|м|муж=Мужской род<!--
        -->|ж|жен=Женский род<!--
        -->|с|мс|жс|ср=Средний род<!--
        -->|о|общ=Общий род<!--
        -->}}}}<!--
    -->]]<!--
  -->}}<!--
-->}}<!--
-->{{#switch:{{{зализняк|}}}<!--
  -->|??|=<!-- ничего не показывать если нет категории по Зализняку
  -->|#default=<!-- иначе показать таблицу склонения
    -->{{#if:{{{фам|}}}<!-- таблица для фамилий
     -->|{{падежи фам
|nom-sg={{{nom-sg}}}
|nom-sg-f={{{nom-sg-f}}}
|nom-pl={{{nom-pl}}}
|gen-sg={{{gen-sg}}}
|gen-sg-f={{{gen-sg-f}}}
|gen-pl={{{gen-pl}}}
|dat-sg={{{dat-sg}}}
|dat-sg-f={{{dat-sg-f}}}
|dat-pl={{{dat-pl}}}
|acc-sg={{{acc-sg}}}
|acc-sg-f={{{acc-sg-f}}}
|acc-pl={{{acc-pl}}}
|ins-sg={{{ins-sg}}}
|ins-sg-f={{{ins-sg-f}}}
|ins-pl={{{ins-pl}}}
|prp-sg={{{prp-sg}}}
|prp-sg-f={{{prp-sg-f}}}
|prp-pl={{{prp-pl}}}
}}
|{{падежи
       |nom-sg=<!--
      -->{{#if:{{{pt|}}}|<!-- pluralia tantum
        -->{{#if:{{{затрудн|}}}|<!-- формы ед. ч. затруднены
          -->{{incorrect|{{{nom-sg}}}}}<!-- основная форма
          -->{{#if:{{{nom-sg2|}}}|<br/>{{incorrect|{{{nom-sg2}}}}}}}<!-- дополнительная форма
          -->|<!-- формы ед. ч. не используются -->{{-}}<!--  
        -->}}|<!-- в остальных случаях 
          -->{{{nom-sg}}}<!-- основная форма
          -->{{#if:{{{nom-sg2|}}}|&nbsp;//<br/>{{{nom-sg2}}}}}<!-- дополнительная форма
      -->}}
       |nom-pl=<!--
      -->{{#if:{{{st|}}}|<!-- singularia tantum
        -->{{#if:{{{затрудн|}}}|<!-- формы мн. ч. затруднены
          -->{{incorrect|{{{nom-pl}}}}}<!-- основная форма
          -->{{#if:{{{nom-pl2|}}}|<br/>{{incorrect|{{{nom-pl2}}}}}}}<!-- дополнительная форма
          -->|<!-- формы мн. ч. не используются -->{{-}}<!--  
        -->}}|<!-- в остальных случаях 
          -->{{{nom-pl}}}<!-- основная форма
          -->{{#if:{{{nom-pl2|}}}|&nbsp;//<br/>{{{nom-pl2}}}}}<!-- дополнительная форма
      -->}}
       |gen-sg=<!--  
      -->{{#if:{{{pt|}}}|<!-- pluralia tantum
        -->{{#if:{{{затрудн|}}}|<!-- формы ед. ч. затруднены
          -->{{incorrect|{{{gen-sg}}}}}<!-- основная форма
          -->{{#if:{{{gen-sg2|}}}|<br/>{{incorrect|{{{gen-sg2}}}}}}}<!-- дополнительная форма
          -->|<!-- формы ед. ч. не используются -->{{-}}<!--  
        -->}}|<!-- в остальных случаях 
          -->{{{gen-sg}}}<!-- основная форма
          -->{{#if:{{{gen-sg2|}}}|&nbsp;//<br/>{{{gen-sg2}}}}}<!-- дополнительная форма
      -->}}
       |gen-pl=<!-- 
      -->{{#if:{{{obelus|}}}|<!-- образование род. п. мн. ч. затруднительно
        -->{{incorrect|{{{gen-pl}}}}}|<!-- 
      -->{{#if:{{{st|}}}|<!-- singularia tantum
        -->{{#if:{{{затрудн|}}}|<!-- формы мн. ч. затруднены
          -->{{incorrect|{{{gen-pl}}}}}<!-- основная форма
          -->{{#if:{{{gen-pl2|}}}|<br/>{{incorrect|{{{gen-pl2}}}}}}}<!-- дополнительная форма
          -->|<!-- формы мн. ч. не используются -->{{-}}<!--  
        -->}}|<!-- в остальных случаях 
          -->{{{gen-pl}}}<!-- основная форма
          -->{{#if:{{{gen-pl2|}}}|&nbsp;//<br/>{{{gen-pl2}}}}}<!-- дополнительная форма
      -->}}}}
       |dat-sg=<!-- 
      -->{{#if:{{{pt|}}}|<!-- pluralia tantum
        -->{{#if:{{{затрудн|}}}|<!-- формы ед. ч. затруднены
          -->{{incorrect|{{{dat-sg}}}}}<!-- основная форма
          -->{{#if:{{{dat-sg2|}}}|<br/>{{incorrect|{{{dat-sg2}}}}}}}<!-- дополнительная форма
          -->|<!-- формы ед. ч. не используются -->{{-}}<!--  
        -->}}|<!-- в остальных случаях 
          -->{{{dat-sg}}}<!-- основная форма 
          -->{{#if:{{{dat-sg2|}}}|&nbsp;//<br/>{{{dat-sg2}}}}}<!-- дополнительная форма
      -->}}
       |dat-pl=<!-- 
      -->{{#if:{{{st|}}}|<!-- singularia tantum
        -->{{#if:{{{затрудн|}}}|<!-- формы мн. ч. затруднены
          -->{{incorrect|{{{dat-pl}}}}}<!-- основная форма  
          -->{{#if:{{{dat-pl2|}}}|<br/>{{incorrect|{{{dat-pl2}}}}}}}<!-- дополнительная форма
          -->|<!-- формы мн. ч. не используются -->{{-}}<!--  
        -->}}|<!-- в остальных случаях 
          -->{{{dat-pl}}}<!-- основная форма 
          -->{{#if:{{{dat-pl2|}}}|&nbsp;//<br/>{{{dat-pl2}}}}}<!-- дополнительная форма
      -->}}
       |acc-sg=<!-- 
      -->{{#if:{{{pt|}}}|<!-- pluralia tantum
        -->{{#if:{{{затрудн|}}}|<!-- формы ед. ч. затруднены
          -->{{incorrect|{{{acc-sg}}}}}<!-- основная форма
          -->{{#if:{{{acc-sg2|}}}|<br/>{{incorrect|{{{acc-sg2}}}}}}}<!-- дополнительная форма
          -->|<!-- формы ед. ч. не используются -->{{-}}<!--  
        -->}}|<!-- в остальных случаях 
          -->{{{acc-sg}}}<!-- основная форма 
          -->{{#if:{{{acc-sg2|}}}|&nbsp;//<br/>{{{acc-sg2}}}}}<!-- дополнительная форма
      -->}}
       |acc-pl=<!--
      -->{{#if:{{{st|}}}|<!-- singularia tantum
        -->{{#if:{{{затрудн|}}}|<!-- формы мн. ч. затруднены
          -->{{incorrect|{{{acc-pl}}}}}<!-- основная форма 
          -->{{#if:{{{acc-pl2|}}}|<br/>{{incorrect|{{{acc-pl2}}}}}}}<!-- дополнительная форма
          -->|<!-- формы мн. ч. не используются -->{{-}}<!--  
        -->}}|<!-- в остальных случаях  
          -->{{{acc-pl}}}<!-- основная форма
          -->{{#if:{{{acc-pl2|}}}|&nbsp;//<br/>{{{acc-pl2}}}}}<!-- дополнительная форма
      -->}}
       |ins-sg=<!-- 
      -->{{#if:{{{pt|}}}|<!-- pluralia tantum
        -->{{#if:{{{затрудн|}}}|<!-- формы ед. ч. затруднены
          -->{{incorrect|{{{ins-sg}}}}}<!--основная форма
          -->{{#if:{{{ins-sg2|}}}|<br/>{{incorrect|{{{ins-sg2}}}}}}}<!-- дополнительная форма
          -->|<!-- формы ед. ч. не используются -->{{-}}<!--  
        -->}}|<!-- в остальных случаях 
          -->{{{ins-sg}}}<!-- основная форма
          -->{{#if:{{{ins-sg2|}}}|<br/>{{{ins-sg2}}}}}<!-- дополнительная форма
      -->}}
       |ins-pl=<!-- 
      -->{{#if:{{{st|}}}|<!--singularia tantum
        -->{{#if:{{{затрудн|}}}|<!-- формы мн. ч. затруднены
          -->{{incorrect|{{{ins-pl}}}}}<!-- основная форма   
          -->{{#if:{{{ins-pl2|}}}|<br/>{{incorrect|{{{ins-pl2}}}}}}}<!-- дополнительная форма
          -->|<!-- формы мн. ч. не используются -->{{-}}<!--  
        -->}}|<!-- в остальных случаях
          -->{{{ins-pl}}}<!-- основная форма
          -->{{#if:{{{ins-pl2|}}}|&nbsp;//<br/>{{{ins-pl2}}}}}<!-- дополнительная форма
      -->}}
       |prp-sg=<!-- 
      -->{{#if:{{{pt|}}}|<!-- pluralia tantum
        -->{{#if:{{{затрудн|}}}|<!-- формы ед. ч. затруднены
          -->{{incorrect|{{{prp-sg}}}}}<!--основная форма
          -->{{#if:{{{prp-sg2|}}}|<br/>{{incorrect|{{{prp-sg2}}}}}}}<!-- дополнительная форма
          -->|<!-- формы ед. ч. не используются -->{{-}}<!--  
        -->}}|<!-- в остальных случаях
          -->{{{prp-sg}}}<!-- основная форма
      -->{{#if:{{{prp-sg2|}}}|&nbsp;//<br/>{{{prp-sg2}}}}}<!-- дополнительная форма
      -->}}
       |prp-pl=<!-- {{{prp-pl}}}
      -->{{#if:{{{st|}}}|<!-- singularia tantum
        -->{{#if:{{{затрудн|}}}|<!-- формы мн. ч. затруднены
          -->{{incorrect|{{{prp-pl}}}}}<!-- основная форма   
          -->{{#if:{{{prp-pl2|}}}|<br/>{{incorrect|{{{prp-pl2}}}}}}}<!-- дополнительная форма
          -->|<!-- формы мн. ч. не используются -->{{-}}<!--  
        -->}}|<!-- в остальных случаях 
          -->{{{prp-pl}}}<!-- основная форма
          -->{{#if:{{{prp-pl2|}}}|&nbsp;//<br/>{{{prp-pl2}}}}}<!-- дополнительная форма
      -->}}
       |loc-sg={{{loc-sg|}}}
       |voc-sg={{{voc-sg|}}}
       |prt-sg={{{prt-sg|}}}
       |П={{{П|}}}
       |acc2-sg={{{Пр|}}}
       |adnum={{{Сч|}}}
       }}<!--
-->}}}}<!-- вывод текста
-->{{inflection/ru/noun/text
   |hide-text={{{hide-text|}}}
   |зачин={{{зачин|}}}
   |слоги={{{слоги|}}}
   |дореф={{{дореф|}}}
   |кат={{{кат|}}}
   |род={{{род|}}}
   |скл={{{скл|}}}
   |зализняк={{{зализняк|}}}
   |зализняк1={{{зализняк1|}}}
   |фам={{{фам|}}}
   |pt={{{pt|}}}
   |st={{{st|}}}
   |obelus={{{obelus|}}}
   |затрудн={{{затрудн|}}}
   |коммент={{{коммент|}}}
   |клитика={{{клитика|}}}
   }}<!-- формирование категорий
-->{{inflection/ru/noun/cat
   |кат={{{кат|}}}
   |род={{{род|}}}
   |скл={{{скл|}}}
   |зализняк={{{зализняк|}}}
   |зализняк-1={{{зализняк-1|}}}
   |зализняк-2={{{зализняк-2|}}}
   |чередование={{{чередование|}}}
   |pt={{{pt|}}}
   |st={{{st|}}}
   |затрудн={{{затрудн|}}}
   |loc-sg={{{loc-sg|}}}
   |voc-sg={{{voc-sg|}}}
   |prt-sg={{{prt-sg|}}}
   |фам={{{фам|}}}
}}}}<noinclude>{{doc}}
[[Категория:Шаблоны словоизменений/Существительные]]
</noinclude>
