from projects.inflection.scripts.lib.run import noun, adj


if __name__ == '__main__':

    # noun('сло́во', 'с 1c')
    # noun('ко́шка', 'жо *a')

    # noun('наро́душко', 'м <с 3*a(1)>, Р2')

    # noun('бэ́гги', 'мн. неод. 0')
    # noun('соцнаём', 'м 1*a')
    # noun('а̀виатури́зм', 'м 1a')

    # noun('Ва́ли', 'мн. <жо 2a>')
    # noun('Любо́ви', 'мн. <жо 8a>')

    # noun('топо́р', 'м 1b')

    # noun('жа̀ропонижа́ющее', 'с <п 4a>')
    # noun('бу̀ги-ву́ги', 'с//м, 0')

    # noun('во́льная', 'ж <п 1a>')
    # noun('ка́бельтов', 'м <мс 1a>')

    # noun('железа́', 'ж f ё')
    # noun('го́род-геро́й', 'м, 1c(1) + 6a')

    # noun('ку́хня-гости́ная|ж, 2*a + <п 1a>')

    noun('мозолено́гие|мн. одуш. <п 3a>')

    # adj('хоро́ший', '4a')
    # adj('но́вый', "1a/c'")
    # adj('кито́вый', "1a")
    # adj('а́лый', "1a'")

    # adj('удо́бный', "1*a")
    # adj('бу́йный', "1*a'")
    # adj('у́мный', "1*a/b")
    # adj('дурно́й', "1*b/c'")

    # adj('разносторо́нний', '2*a')
    # adj('вы́спренний', '2*a(1)')

    # adj('самоуве́ренный', '1*a(1)')
    # adj('ме́дленный', '1*a[(1)]')

    # adj("ве́рный", "1*a/c′")
    # adj("гро́мкий", "3*a/c")

    # adj("квёлый", "1a', ё")
    # adj("тяжёлый|1a/b, ё")
    # adj("искушённый|1*a/b(2), ё")
